 [
    {
      "name": "Mitul Gadhia - UK",
      "position": "CEO | Taylors Capital",
      "title": "One-Stop Shop for All Business Needs",
      "image": "https://dubiz.co/public/assets/img/testimonial/taylor.webp?v=2.6.0",
      "quote": "Dubiz played a crucial role in our successful establishment in Dubai. Their experts bring diverse knowledge from different fields and were cooperative throughout the entire process. They handled all the legal paperwork and approvals seamlessly for us. With them, you get a team of the best company formation experts. Highly recommended!"
    },
    {
      "name": "Parimal Shah - India",
      "position": "Founder & CEO | Cherise Global",
      "title": "A Game Changer for Global Expansion",
      "image": "https://dubiz.co/public/assets/img/testimonial/cherise.webp?v=2.6.0",
      "quote": "Working with Dubiz was a true partnership. Their team's deep knowledge of international business law cut through the complexities, making our business expansion surprisingly smooth. With Dubiz's guidance, Cherise Global confidently scaled operations overseas. We positively recommend them to any company with global ambitions."
    },
    {
      "name": "Ravi Kumar - Malaysia",
      "position": "CEO | RKG Wealth",
      "title": "A Team That Gets It Done",
      "image": "https://dubiz.co/public/assets/img/testimonial/rkg.webp?v=2.6.0",
      "quote": "Partnering with Dubiz was best decision that we made. They made our Dubai launch so seamless and stress-free. We obtained licenses, visas and bank account for our business swiftly without any complications. The team's profound knowledge & dedication to excellence is commendable. Looking forward to working with them again in future."
    },
    {
      "name": "Farid Dallal - Brazil",
      "position": "CEO | Motoboy.ae",
      "title": "Trusted Partner",
      "image": "https://dubiz.co/public/assets/img/testimonial/motoboy.webp?v=2.6.0",
      "quote": "Dubiz wasn't just a service; they were a trusted partner in launching Motoboy. From our first meeting to finalising the setup, the Dubiz team provided constant support. Their comprehensive business setup services and professional handling of legal and financial aspects were invaluable assets that helped us grow better."
    }
  ]